
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.Дата      = ТекущаяДата();
		Объект.Сотрудник = Константы.ТекущийПользователь.Получить();
	КонецЕсли;
	ДополнительныеФункцииСервер.ПрисоединенныеФайлы_ИнициализироватьТаблицуПрисоединенныхФайлов(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбщийМодульКлиент.ЗафиксироватьМестоположение(Объект.Ссылка,"Внеплановое действие");
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ДополнительныеФункцииСервер.ПрисоединенныеФайлы_СохранитьПрисоединенныеФайлы(ЭтаФорма);
КонецПроцедуры

#ОБЛАСТЬ ПРИСОЕДИНЕННЫЕФАЙЛЫ

&НаКлиенте
Процедура ДобавитьФайл()
	
	ПараметрыФайла = ДополнительныеФункцииКлиент.ПрисоединенныеФайлы_ДобавитьФайл(ЭтаФорма);
	
	Если ТипЗнч(ПараметрыФайла) = Тип("Структура") Тогда
	
		ДопПараметры = Новый Структура();
		ДопПараметры.Вставить("ПутьКФайлу", ПараметрыФайла.ПутьКФайлу);
		ДопПараметры.Вставить("Расширение", ПараметрыФайла.Расширение);
		ДопПараметры.Вставить("Форма", ЭтаФорма);
						
		Оп = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормыИзображения", ЭтотОбъект, ДопПараметры);
		ОткрытьФорму("ОбщаяФорма.ФормаИзображения", Новый Структура("ПутьКФайлу", ПараметрыФайла.ПутьКФайлу),,,,,Оп,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияФормыИзображения(Результат, ДопПараметры) Экспорт
	
	Если Результат = Истина Тогда
		ДополнительныеФункцииКлиент.ДобавитьФайлВТаблицуПрисоединенных(Результат, ДопПараметры);   
		ОбновитьРеквизитыФормы();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура УдалитьФайл ()
	ДополнительныеФункцииКлиент.ПрисоединенныеФайлы_УдалитьФайл(ЭтаФорма);
	ОбновитьРеквизитыФормы();
КонецПроцедуры	

&НаСервере
Процедура ОбновитьРеквизитыФормы ()  
	ДополнительныеФункцииСервер.ПрисоединенныеФайлы_ОбновитьРеквизитыФормы(ЭтаФорма);	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПодгрузитьФото(Элемент, ТекущаяСтраница)
	
	ПодгрузитьФотоНаСервере(ТекущаяСтраница.Имя)
	
КонецПроцедуры

&НаСервере
Процедура ПодгрузитьФотоНаСервере(ТекущаяСтраницаИмя)
	
	ДополнительныеФункцииСервер.ПодгрузитьФотоНаСервере(ТекущаяСтраницаИмя, ЭтаФорма)
	
КонецПроцедуры

#КОНЕЦОБЛАСТИ
