
Функция ВидыЗаданийТорговымПредставителямПолучитьПредопределенныйЭлемент( Идентификатор ) Экспорт
	Возврат Справочники.ВидыЗаданийТорговымПредставителям.ПолучитьПредопределенныйЭлемент( Идентификатор );
КонецФункции

Функция ШаблонАнкетыДляТППолучитьПредопределенныйЭлемент( Идентификатор ) Экспорт
	Возврат Справочники.ШаблонАнкетыДляТП.ПолучитьПредопределенныйЭлемент( Идентификатор );
КонецФункции

Функция ВидыКомментариевПолучитьПредопределенныйЭлемент( Идентификатор ) Экспорт
	Возврат Справочники.ВидыКомментариев.ПолучитьПредопределенныйЭлемент( Идентификатор );
КонецФункции

Функция ПолучитьОсновнойТипПосещения() Экспорт
	
	Всп = Константы.ТекущийПользователь.Получить();	Если Ложь Тогда	Всп = Справочники.Пользователи.СоздатьЭлемент();	КонецЕсли;
	Если ЗначениеЗаполнено( Всп ) И ЗначениеЗаполнено(Всп.ОсновнойТипПосещения) Тогда
		Возврат Всп.ОсновнойТипПосещения;
	Иначе
		Возврат Справочники.ТипыПосещенийКлиентовТорговымиПредставителями.НайтиПоРеквизиту("Идентификатор", "Стандартное");
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТипВнеплановогоПосещения() Экспорт
	
	Всп = Константы.ТекущийПользователь.Получить();	Если Ложь Тогда	Всп = Справочники.Пользователи.СоздатьЭлемент();	КонецЕсли;
	Если ЗначениеЗаполнено( Всп ) И ЗначениеЗаполнено(Всп.ТипВнеплановогоПосещения) Тогда
		Возврат Всп.ТипВнеплановогоПосещения;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаршрутЗаданияТП.ТипПосещения,
		|	КОЛИЧЕСТВО(МаршрутЗаданияТП.НомерСтроки) КАК Кол
		|ИЗ
		|	Документ.Маршрут.ЗаданияТП КАК МаршрутЗаданияТП
		|
		|СГРУППИРОВАТЬ ПО
		|	МаршрутЗаданияТП.ТипПосещения
		|
		|УПОРЯДОЧИТЬ ПО
		|	Кол УБЫВ";
		РезультатЗапроса = Запрос.Выполнить();
		
		ТЗ = РезультатЗапроса.Выгрузить();
		Если ТЗ.Количество() = 0 Тогда
			Возврат Константы.ТипВнеплановогоПосещения.Получить();
		Иначе
			Всп = ТЗ[0].ТипПосещения;
			Если ЗначениеЗаполнено(Всп) Тогда
				Возврат Всп;
			Иначе
				Возврат Константы.ТипВнеплановогоПосещения.Получить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТипПосещенияТелефонныйЗвонок() Экспорт
	
	Всп = Константы.ТекущийПользователь.Получить();	Если Ложь Тогда	Всп = Справочники.Пользователи.СоздатьЭлемент();	КонецЕсли;
	Если ЗначениеЗаполнено( Всп ) И ЗначениеЗаполнено(Всп.ТипДополнительногоПосещения) Тогда
		Возврат Всп.ТипДополнительногоПосещения;
	Иначе
		Возврат Константы.ТипПосещенияТелефонныйЗвонок.Получить();
	КонецЕсли;
	
КонецФункции

Функция ПолучитьФизЛицоТекущегоПользователя() Экспорт
	Всп = Константы.ТекущийПользователь.Получить();
	Если ЗначениеЗаполнено( Всп ) Тогда
		Возврат Всп.ФизЛицо;
	КонецЕсли;
КонецФункции
