Процедура СоздатьДокументы () Экспорт
	НачатьТранзакцию();
	
	ТекущийПользователь = Константы.ТекущийПользователь.Получить();
	
	// Начинаем рабочий день //
	ТекРабочийДень = ОбщийМодульСервер.ПолучитьАктуальныйРабочийДень();
	Если Не ЗначениеЗаполнено(ТекРабочийДень) Или ТекРабочийДень.Завершен Тогда
		Док            = Документы.РабочийДень.СоздатьДокумент();
		Док.Дата       = ТекущаяДата();
		Док.ДатаНачала = ТекущаяДата();
		Док.Сотрудник  = ПараметрыСеанса.ТекущийПользователь;
		Док.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		ТекРабочийДень = Док.Ссылка;	
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 50
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.ЭтоГруппа";
	Выборка    = Запрос.Выполнить().Выгрузить();
	ГСЧ        = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	Индекс     = ГСЧ.СлучайноеЧисло(0,50);
	ТЗ         = Запрос.Выполнить().Выгрузить();
	Контрагент = ?(ТЗ.Количество() <= ИНДЕКС, ТЗ[0].Ссылка,ТЗ[Индекс].Ссылка);
	
	// Начинаем посещение //
	Док = Документы.Посещение.СоздатьДокумент();
	Док.Контрагент   = Контрагент;
	Док.Сотрудник    = ПараметрыСеанса.ТекущийПользователь;
	Док.ВидПосещения = Перечисления.ВидыПосещений.ВнеплановоеПосещение;
	Док.Дата         = ТекущаяДата();
	Док.РабочийДень  = ТекРабочийДень; 	
	Док.ДатаНачала   = ТекущаяДата();
	Док.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
	ТекПосещение = Док.Ссылка;
	
	// Делаем заказ //
	Док                    = Документы.ЗаказПокупателя.СоздатьДокумент();
	Док.Контрагент         = Контрагент;
	Док.Ответственный      = ТекущийПользователь;
	Док.Посещение          = ТекПосещение;
	Док.Дата               = ТекущаяДата();
	Док.ДатаДоставки       = КонецНедели(ТекущаяДата());
	Док.ДоговорКонтрагента = Контрагент.ОсновнойДоговор;
	Док.ТипЦен             = Контрагент.ОсновнойДоговор.ТипЦен;
	Док.ВидДокумента       = Перечисления.ВидыЗаказа.ОсновнойЗаказ;
	КолТоваров             = 20;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧ.Номенклатура,
	|	ТЧ.ХарактеристикаНоменклатуры,
	|	ТЧ.ТипЦен,
	|	ТЧ.Цена,
	|	ТЧ.ЕдиницаИзмерения
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ТипЦен = &ТипЦен) КАК ТЧ";
	Запрос.УстановитьПараметр("ТипЦен",Контрагент.ОсновнойДоговор.ТипЦен);
	Рез = Запрос.Выполнить().Выгрузить();
	Для СЧ = 1 По КолТоваров Цикл
		ИскомаяСтрока = Рез[ГСЧ.СлучайноеЧисло(1,Рез.Количество()) - 1];
		НоваяСтрока   = Док.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ИскомаяСтрока);
		НоваяСтрока.Количество = ГСЧ.СлучайноеЧисло(1,100);
		НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
	КонецЦикла;	
	Док.Комментарий = "ЭМУЛЯЦИЯ";
	Док.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
	
	// Делаем возврат //
	Док = Документы.ВозвратТоваровОтПокупателя.СоздатьДокумент();
	Док.Контрагент    = Контрагент;
	Док.ДоговорКонтрагента = Контрагент.ОсновнойДоговор;
	Док.ТипЦен             = Контрагент.ОсновнойДоговор.ТипЦен;
	Док.Ответственный = ТекущийПользователь;
	Док.Посещение     = ТекПосещение;
	Док.Дата          = ТекущаяДата();
	Док.ДатаДоставки  = КонецНедели(ТекущаяДата());
	Док.ТипЦен        = Контрагент.ОсновнойДоговор.ТипЦен;
	КолТоваров        = 20;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧ.Номенклатура,
	|	ТЧ.ХарактеристикаНоменклатуры,
	|	ТЧ.ТипЦен,
	|	ТЧ.Цена,
	|	ТЧ.ЕдиницаИзмерения
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ТипЦен = &ТипЦен) КАК ТЧ";
	Запрос.УстановитьПараметр("ТипЦен",Контрагент.ОсновнойДоговор.ТипЦен);
	Рез = Запрос.Выполнить().Выгрузить();
	Для СЧ = 1 По КолТоваров Цикл
		ИскомаяСтрока = Рез[ГСЧ.СлучайноеЧисло(1,Рез.Количество()) - 1];
		НоваяСтрока   = Док.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ИскомаяСтрока);
		НоваяСтрока.Количество = ГСЧ.СлучайноеЧисло(1,100);
		НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
	КонецЦикла;	
	Док.Комментарий = "ЭМУЛЯЦИЯ";
	Док.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
	
	// Делаем комментарий //
	Док = Документы.Комментарий.СоздатьДокумент();
	Док.Контрагент    = Контрагент;
	Док.Сотрудник     = ТекущийПользователь;
	Док.Посещение     = ТекПосещение;
	Док.Дата          = ТекущаяДата();
	Док.Комментарий = "ЭМУЛЯЦИЯ";
	Выборка = Справочники.ВидыКомментариев.Выбрать();
	Выборка.Следующий();
	Док.ВидКомментария = Выборка.Ссылка;
	Док.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
	
	Запись = РегистрыСведений.ОС_ПрисоединенныеФайлы.СоздатьМенеджерЗаписи();
	Запись.СсылкаНаОбъект     = Док.Ссылка;
	Запись.ИдентификаторФайла = Новый УникальныйИдентификатор;
	Запись.ХранилищеДанных    = Новый ХранилищеЗначения(ПолучитьОбщийМакет("ТестоваяКартинка"));
	Запись.Расширение         = "png";
	Запись.ТипСодержимого     = "image / jpeg";
	Запись.Записать();
	
	// Завершаем посещение //
	Стр               = РегистрыСведений.СостоянияПосещений.ПолучитьПоследнее();
	Док               = Стр.Посещение.ПолучитьОбъект();
	Док.ДатаОкончания = ТекущаяДата();
	Док.Завершено     = Истина;
	Док.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
	
	
	// Делаем внеплановое действие //
	Док = Документы.ВнеплановоеДействие.СоздатьДокумент();
	Док.Сотрудник    = ТекущийПользователь;
	Док.Комментарий  = "ЭМУЛЯЦИЯ";
	Док.Дата         = ТекущаяДата();
	Док.Записать();	
	
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры	
