
// РАБОТА С ДОПОЛНИТЕЛЬНЫМИ РЕКВИЗИТАМИ //

Процедура ДобавитьДополнительныеРеквизиты (Форма,ТипОбъекта,ГруппаФормы, ТаблицаДопРеквизитов = "") Экспорт
	СписокДопРеквизитов = СписокДополнительныхРеквизитов(ТипОбъекта);
	
	Если СписокДопРеквизитов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЭтоАдресВременногоХранилища(ТаблицаДопРеквизитов) Тогда
		Таблица = ПолучитьИзВременногоХранилища(ТаблицаДопРеквизитов);
	Иначе
		Таблица = Новый ТаблицаЗначений;
		Таблица.Колонки.Добавить("Свойство");
		Таблица.Колонки.Добавить("Значение");
	КонецЕсли;	
	
	ДобавляемыеРеквизиты = Новый Массив;
	Для Каждого ДопРеквизит Из СписокДопРеквизитов Цикл
		ИмяДР = СформироватьИмяДопРеквизита(ДопРеквизит); 
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗнч(ДопРеквизит.Типзначения));
		Реквизит    = Новый РеквизитФормы(ИмяДР,Новый ОписаниеТипов(МассивТипов),,ДопРеквизит.Наименование);
		ДобавляемыеРеквизиты.Добавить(Реквизит);
	КонецЦикла;	
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Для Каждого ДопРеквизит Из СписокДопРеквизитов Цикл
		ИмяДР    = СформироватьИмяДопРеквизита(ДопРеквизит);
		Поле     = Форма.Элементы.Добавить(ИмяДР,Тип("ПолеФормы"),ГруппаФормы);
		Если ТипЗнч(ДопРеквизит.Типзначения) = Тип ("Булево") Тогда
			Поле.Вид = ВидПоляФормы.ПолеВвода;
		Иначе 
			Поле.Вид = ВидПоляФормы.ПолеФлажка;
		КонецЕсли;
		Поле.ПутьКДанным = СформироватьИмяДопРеквизита(ДопРеквизит);
		ИскомаяСтрока = Таблица.Найти(ДопРеквизит,"Свойство");
		Если ИскомаяСтрока <> Неопределено Тогда 
			Форма[ИмяДР] = ИскомаяСтрока.Значение;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры	

Функция ПолучитьТаблицуДополнительныхРеквизитов (Форма,ТипОбъекта,ГруппаФормы) Экспорт
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Свойство");
	Таблица.Колонки.Добавить("Значение");
	СписокДопРеквизитов = СписокДополнительныхРеквизитов(ТипОбъекта);
	Для Каждого ДопРеквизит Из СписокДопРеквизитов Цикл
		ИмяДР = СформироватьИмяДопРеквизита(ДопРеквизит);
		Если Форма.Элементы.Найти(ИмяДР) <> Неопределено Тогда
			Значение = Форма[ИмяДР];
			Если ЗначениеЗаполнено(Значение) Тогда
				НоваяСтрока = Таблица.Добавить();
				НоваяСтрока.Свойство = ДопРеквизит;
				НоваяСтрока.Значение = Значение;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	Возврат ПоместитьВоВременноеХранилище(Таблица,Новый УникальныйИдентификатор);
КонецФункции	

Функция СписокДополнительныхРеквизитов (ТипОбъекта)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеРеквизиты.Ссылка
	|ИЗ
	|	Справочник.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ДополнительныеРеквизиты.Назначение) = &Назначение";
	Запрос.УстановитьПараметр("Назначение",ТипОбъекта);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции	

Функция СформироватьИмяДопРеквизита (ДопРеквизит)
	Возврат "ДопРеквизит_" + СтрЗаменить(Строка(ДопРеквизит.УникальныйИдентификатор()),"-","_");
КонецФункции	

// РАБОТА С АНКЕТАМИ //