
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Контрагент = Параметры.Контрагент;
	Посещение  = Параметры.Посещение;
	СформироватьОтчет();
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет ()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка КАК Ссылка,
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.ЕдиницаИзмерения,
	|	ЗаказПокупателяТовары.Количество,
	|	ЗаказПокупателяТовары.Сумма,
	|	ЗаказПокупателяТовары.ПроцентСкидкиНаценки
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка.Посещение = &Посещение
	|	И ЗаказПокупателяТовары.Ссылка.Проведен";
	Запрос.УстановитьПараметр("Посещение",Посещение);
	Всего   = 0;
	ТЗ      = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	ТЗКопия = ТЗ.Скопировать();
	ТЗКопия.Свернуть("Ссылка");
	
	Для Каждого СтрокаТЧ Из ТЗКопия Цикл
		НоваяСтрокаЗаказ = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаЗаказ,СтрокаТЧ);
		НоваяСтрокаЗаказ.ТекстДоставки = СтрокаТЧ.Ссылка.Номер + ". Доставка на " + ОбщийМодульСервер.ФорматДаты(СтрокаТЧ.Ссылка.ДатаДоставки,Истина);
		ИскомыеСтроки = ТЗ.НайтиСтроки(Новый Структура("Ссылка",СтрокаТЧ.Ссылка));
		Для Каждого ИскомаяСтрока Из ИскомыеСтроки Цикл
			НоваяСтрока = Результат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ИскомаяСтрока);
			Всего = Всего + ИскомаяСтрока.Сумма;
		КонецЦикла;	
	КонецЦикла;	
	
	Если Результат.Количество() = 0 Тогда
		Элементы.ДекорацияНетДанных.Заголовок = "<< НЕТ ДАННЫХ >>";
	Иначе
		Элементы.ДекорацияНетДанных.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры
