
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	Для Каждого ТекСтрокаНоменклатураДоговора Из НоменклатураДоговора Цикл
		Движение = Движения.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Добавить();
		Движение.Период                                                = Дата;
		Движение.ДоговорКонтрагента                                    = ДоговорКонтрагента;
		Движение.Номенклатура                                          = ТекСтрокаНоменклатураДоговора.Номенклатура;
		Движение.ХарактеристикаНоменклатуры                            = ТекСтрокаНоменклатураДоговора.ХарактеристикаНоменклатуры;
		Движение.Цена                                                  = ТекСтрокаНоменклатураДоговора.Цена;
		Движение.Количество                                            = ТекСтрокаНоменклатураДоговора.Количество;
		Движение.ЕдиницаИзмерения                                      = ТекСтрокаНоменклатураДоговора.ЕдиницаИзмерения;
		Движение.НеПринимаетсяКВозвратуПоИстеченииСрокаГодностиБалмико = ТекСтрокаНоменклатураДоговора.НеПринимаетсяКВозвратуПоИстеченииСрокаГодностиБалмико;
		Движение.ДатаОкончания                                         = ДатаОкончания;
	КонецЦикла;
КонецПроцедуры
