Процедура ОС_ЗаписьЖурналаРегистрации (ИмяСобытия,Уровень = 0,Данные = "",Комментарий = "")  Экспорт
	ИмяФайлаЛогов = ПолучитьИмяФайлаЛогов();
	Запись = Новый ЗаписьТекста();
	Попытка
		Запись.Открыть(ИмяФайлаЛогов,"UTF-8",,Истина);
		СтрокаЗаписи = "" + ТекущаяДата() + Символы.Таб + ИмяСобытия + Символы.Таб + Данные +  Символы.Таб + Комментарий; 
		СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи,Символы.ПС,Символы.Таб);
		Запись.ЗаписатьСтроку(СтрокаЗаписи);	
		Запись.Закрыть();
	Исключение
	КонецПопытки;
	
	#ЕСЛИ МОБИЛЬНОЕПРИЛОЖЕНИЕСЕРВЕР ТОГДА
		
	#ИНАЧЕ
		ЗаписьЖурналаРегистрации(ИмяСобытия,,,Данные,Комментарий);
	#КОНЕЦЕСЛИ
КонецПроцедуры	

Функция ПолучитьИмяФайлаЛогов () Экспорт
	Возврат КаталогВременныхФайлов() + "/log1c.txt"; 
КонецФункции	

Функция ОчиститьФайлЛогов () Экспорт
	ИмяФайлаЛогов = ПолучитьИмяФайлаЛогов();
	Запись = Новый ЗаписьТекста();
	Запись.Открыть(ИмяФайлаЛогов,"UTF-8",,Ложь);
	Запись.Закрыть();
	ОбщийМодульСервер.УстановитьЗначениеКонстанты("ДатаПоследнейОчисткиЛогов",ТекущаяДата());
КонецФункции	

Процедура ПриЗаписиСсылочногоОбъектаПриЗаписи(Источник, Отказ) Экспорт
	Если ПараметрыСеанса.ЗаписыватьЛоги Тогда
		ОС_ЗаписьЖурналаРегистрации(?(Источник.Этоновый(),"Добавление","Изменение"),,Источник.Ссылка);	
	КонецЕсли;	
КонецПроцедуры

Процедура ЗаписьЛогаПриЗаписиРегистраПриЗаписи(Источник, Отказ, Замещение) Экспорт
	Если ПараметрыСеанса.ЗаписыватьЛоги Тогда
		ОС_ЗаписьЖурналаРегистрации("Изменение",,Строка(ТипЗнч(Источник)));	
	КонецЕсли;	
КонецПроцедуры
