// КЛИЕНТСКИЕ ПРОЦЕДУРЫ И ФУНКЦИИ //

&НаКлиенте
Процедура Сохранить(Команда)
	Рез = Новый Структура;
	Для Каждого Эл Из СтруктураПараметров() Цикл
		Рез.Вставить(Эл.Ключ,ЭтаФорма[Эл.Ключ]);	
	КонецЦикла;
	Закрыть(Рез);
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	Закрыть();
КонецПроцедуры

// СЕРВЕРНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ //

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для Каждого Эл Из СтруктураПараметров() Цикл
		ЭтаФорма[Эл.Значение] = Параметры[Эл.Ключ];
	КонецЦикла;	
КонецПроцедуры

&НаСервереБезКонтекста 
Функция СтруктураПараметров ()
	Стр = Новый Структура;
	Стр.Вставить("Контрагент"                ,"Контрагент");
	Стр.Вставить("Номенклатура"              ,"Номенклатура");
	Стр.Вставить("Цена"                      ,"Цена");
	Стр.Вставить("ХарактеристикаНоменклатуры","ХарактеристикаНоменклатуры");
	Возврат Стр;	
КонецФункции	
