
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	МассивСтрокДляУдаления = Новый Массив;
	Для Каждого Строка из Товары Цикл 
		Если Строка.Количество = 0 Тогда
			МассивСтрокДляУдаления.Добавить(Строка);
			//Сообщить("В строке " + Строка.НомерСтроки + " не заполнено количество. Запись невозможна");
			//Отказ = Истина;
			//Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка из МассивСтрокДляУдаления Цикл
		Товары.Удалить(Строка);
	КонецЦикла;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли;	
	ТорговыйПредставитель = Ответственный.ФизЛицо;
	СуммаДокумента = Товары.Итог("Сумма");
	КоличествоSKU = Товары.Количество();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РегистрыСведений.ВыполнениеЗаданийТП.ОтметитьВыполнениеЗаданияТП( Посещение.Маршрут, Контрагент, "Возврат", Ссылка );
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	РегистрыСведений.ВыполнениеЗаданийТП.УдалитьВыполнениеЗаданияТП( Ссылка );
	
КонецПроцедуры
