
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "УведомлениеПрочитано" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Прочитано(Команда)
	ТекДанные = Элементы.Список.ТекущаяСтрока;
	Если ТекДанные <> Неопределено Тогда
		ПрочитаноСервер(ТекДанные);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПрочитаноСервер (ТекСсылка)
	мОбъект = ТекСсылка.ПолучитьОбъект();
	мОбъект.Прочитано = Истина;
	мОбъект.Записать();
КонецПроцедуры	
