
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Контрагент = Параметры.Контрагент;
	СформироватьОтчет();
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет ()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	"""" КАК ДокументРасчетов,
	|	ДанныеВзаиморасчетов.КонечныйОстаток КАК Сумма
	|ИЗ
	|	РегистрСведений.ОС_ДанныеВзаиморасчетовДляМП КАК ДанныеВзаиморасчетов
	|ГДЕ
	|	ДанныеВзаиморасчетов.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Результат.Загрузить(Запрос.Выполнить().Выгрузить());
	Если Результат.Количество() = 0 Тогда
		Элементы.ДекорацияНетДанных.Заголовок = "<< НЕТ ДАННЫХ >>";
	Иначе
		Элементы.ДекорацияНетДанных.Заголовок = "Итого: " + Результат.Итог("Сумма") + " р.";
	КонецЕсли;	
КонецПроцедуры	