
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ПринадлежностьНоменклатурыГруппам
	Движения.ПринадлежностьНоменклатурыГруппам.Записывать = Истина;
	Для Каждого ТекСтрокаСписокНоменклатуры Из СписокНоменклатуры Цикл
		Движение = Движения.ПринадлежностьНоменклатурыГруппам.Добавить();
		Движение.Период = Дата;
		Движение.Пользователь = Пользователь;
		Движение.Номенклатура = ТекСтрокаСписокНоменклатуры.Номенклатура;
		Движение.Группа = ГруппаНоменклатуры;
		Движение.ПринадлежитГруппе = ТекСтрокаСписокНоменклатуры.ПринадлежитГруппе;
	КонецЦикла;
КонецПроцедуры
