
&НаКлиенте
Процедура ПринятьОбновления(Команда)
	Закрыть();	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ТД = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("ИнформацияОбОбновлении");
	//Область = Макет.ПолучитьОбласть("Область1");
	История.Вывести(Макет);
	//История.ОтображатьЗаголовки = Ложь;
	//История.ОтображатьСетку = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии()
	ПриЗакрытииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриЗакрытииНаСервере()
	Если БольшеНеВыводить Тогда
		Константы.ВерсияДляВыводаОбновления.Установить(Метаданные.Версия);
	КонецЕсли;
КонецПроцедуры

