
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ПринадлежностьКонтрагентовГруппам
	Движения.ПринадлежностьКонтрагентовГруппам.Записывать = Истина;
	Для Каждого ТекСтрокаСписокКонтрагентов Из СписокКонтрагентов Цикл
		Движение = Движения.ПринадлежностьКонтрагентовГруппам.Добавить();
		Движение.Период = Дата;
		Движение.Пользователь = Пользователь;
		Движение.Контрагент = ТекСтрокаСписокКонтрагентов.Контрагент;
		Движение.Группа = ГруппаКонтрагентов;
		Движение.ПринадлежитГруппе = ТекСтрокаСписокКонтрагентов.ПринадлежитГруппе;
	КонецЦикла;
КонецПроцедуры
