
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбщийМодульКлиент.ЗафиксироватьМестоположение(Объект.Ссылка,"Изменение профиля торговой точки");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТаблицаДопРеквизитов = ПоместитьВоВременноеХранилище(Объект.ДополнительныеРеквизиты.Выгрузить(),ЭтаФорма.УникальныйИдентификатор);
	ДополнительныеРеквизитыСервер.ДобавитьДополнительныеРеквизиты(ЭтаФорма,Тип("ДокументСсылка.ИзменениеПрофиляТорговойТочки"),Элементы.ГруппаДополнительныеПараметры, ТаблицаДопРеквизитов);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере()
	Рез = ДополнительныеРеквизитыСервер.ПолучитьТаблицуДополнительныхРеквизитов(ЭтаФорма,Тип("ДокументСсылка.ИзменениеПрофиляТорговойТочки"),Элементы.ГруппаДополнительныеПараметры);
	Если ЭтоАдресВременногоХранилища(Рез) Тогда
		Объект.ДополнительныеРеквизиты.Загрузить(ПолучитьИзВременногоХранилища(Рез));
	КонецЕсли;	
КонецПроцедуры
