
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр СоответствиеТорговыхПредставителейТерриториям
	Движения.СоответствиеТорговыхПредставителейТерриториям.Записывать = Истина;
	Для Каждого ТекСтрокаТерритории Из Территории Цикл
		Движение = Движения.СоответствиеТорговыхПредставителейТерриториям.Добавить();
		Движение.Период                = Дата;
		Движение.Территория            = ТекСтрокаТерритории.Территория;
		Движение.ТорговыйПредставитель = ТекСтрокаТерритории.ТорговыйПредставитель;
	КонецЦикла;
КонецПроцедуры
