
&НаКлиенте
Процедура ФормаОтправить(Команда)
	ЗапуститьПриложение("mailto:");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекстОшибки = Параметры.ТекстОшибки;
	
	МассивИнфы = Новый Массив;
	МассивИнфы.Добавить("ВерсияОС");
	МассивИнфы.Добавить("ВерсияПриложения");
	МассивИнфы.Добавить("ИдентификаторКлиента"); 
	МассивИнфы.Добавить("ИнформацияПрограммыПросмотра");
	МассивИнфы.Добавить("ОперативнаяПамять");
	МассивИнфы.Добавить("Процессор");
	МассивИнфы.Добавить("ТипПлатформы");
	Инфо = Новый СистемнаяИнформация; 
	
	Для Каждого Стр Из МассивИнфы Цикл 
		СтрокаОшибки = СтрокаОшибки + Стр + ": " + Инфо[Стр] + Символы.ПС;
	КонецЦикла; 
	
	СтрКонфигурации = ПолучитьИнфуОКонфигурации();
	
	СтрокаОшибки = СтрокаОшибки + Символы.ПС;
	
	Для Каждого Стр Из СтрКонфигурации Цикл 
		СтрокаОшибки = СтрокаОшибки + Стр.Ключ + ": " + Стр.Значение + Символы.ПС;
	КонецЦикла;	     
	
	ТекстОшибки = СтрокаОшибки + Символы.ПС + "Описание ошибки: " +  Символы.ПС + Символы.ПС + ТекстОшибки;
КонецПроцедуры
