
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ЦеныНоменклатуры
	Движения.ЦеныНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаЦены Из Цены Цикл
		Движение = Движения.ЦеныНоменклатуры.Добавить();
		Движение.Период = Дата;
		Движение.ТипЦен = ТекСтрокаЦены.ТипЦен;
		Движение.Номенклатура = ТекСтрокаЦены.Номенклатура;
		Движение.ХарактеристикаНоменклатуры = ТекСтрокаЦены.ХарактеристикаНоменклатуры;
		Движение.Цена = ТекСтрокаЦены.Цена;
		Движение.ЕдиницаИзмерения = ТекСтрокаЦены.ЕдиницаИзмерения;
	КонецЦикла;
КонецПроцедуры
