#ОБЛАСТЬ ПРИСОЕДИНЕННЫЕФАЙЛЫ 

Процедура ПрисоединенныеФайлы_УдалитьФайл (Форма) Экспорт
	ТекГруппа = Форма.Элементы.ГруппаСтраниц_ПрисоединенныеФайлы.ТекущаяСтраница;
	Если ТекГруппа <> Неопределено Тогда
		ИД = СтрЗаменить(ТекГруппа.Имя,"Страница_","");
		ИД = СтрЗаменить(ИД,"_","-");
		ИскомыеСтроки = Форма.Таблица_ПрисоединенныеФайлы.НайтиСтроки(Новый Структура("ИдФайла",ИД));
		Для Каждого ИскомаяСтрока Из ИскомыеСтроки Цикл
			ИскомаяСтрока.Удалить = Истина;
		КонецЦикла;
		ТекГруппа.Видимость = ЛОЖЬ;
	КонецЕсли;
	ИскомыеСтроки = Форма.Таблица_ПрисоединенныеФайлы.НайтиСтроки(Новый Структура("Удалить",Ложь));
	Если ИскомыеСтроки.Количество() > 0 Тогда
		Форма.Элементы.ГруппаСтраниц_ПрисоединенныеФайлы.ТекущаяСтраница = Форма.Элементы["Страница_" + СтрЗаменить(ИскомыеСтроки[0].ИдФайла,"-","_")];
	КонецЕсли;	
КонецПроцедуры	

Функция ПрисоединенныеФайлы_ДобавитьФайл(Форма)  Экспорт
	#ЕСЛИ МОБИЛЬНОЕПРИЛОЖЕНИЕКЛИЕНТ ТОГДА
		Если СредстваМультимедиа.ПоддерживаетсяФотоснимок(ТипКамерыУстройства.Авто) Тогда
			Если СтрНайти(ИмяКомпьютера(), "K012") = 0 И СтрНайти(ИмяКомпьютера(), "K018") = 0 Тогда
				
				РазрешениеКамеры = Новый РазрешениеКамерыУстройства;
                РазрешениеКамеры.Высота = 5000;
                РазрешениеКамеры.Ширина = 4000;
				Рез = СредстваМультимедиа.СделатьФотоснимок(,РазрешениеКамеры,50);
				Если Рез <> Неопределено Тогда
					Расширение    = Рез.РасширениеФайла;
					ДД        = Рез.ПолучитьДвоичныеДанные();
					ИД         = Форма.УникальныйИдентификатор; //Новый УникальныйИдентификатор();
					
					АдресФайла = ПолучитьИмяВременногоФайла();
					ДД.Записать(АдресФайла);
					
					ДопПараметры = Новый Структура();
					ДопПараметры.Вставить("ПутьКФайлу", АдресФайла);
					ДопПараметры.Вставить("Расширение", Расширение);
					Возврат ДопПараметры;
					
				КонецЕсли;
			Иначе
				Расширение = "png";
				ПутьКФайлу = КаталогДокументов() + "/photo1C.png";
				ЗапускМП   = Новый ЗапускПриложенияМобильногоУстройства();
				ЗапускМП.Действие = "android.media.action.IMAGE_CAPTURE";
				ЗапускМП.ДополнительныеДанные.Добавить("output","file://" + ПутьКФайлу,"Uri");
				
				Рез = ЗапускМП.Запустить(Истина);
				
				Если Рез = -1 Тогда
					ДД = Новый ДвоичныеДанные(ПутьКФайлу);
					ИД         = Форма.УникальныйИдентификатор; //Новый УникальныйИдентификатор();
					АдресФайла = ПоместитьВоВременноеХранилище(ДД, ИД);
					
					НоваяСтрока                = Форма.Таблица_ПрисоединенныеФайлы.Добавить();
					НоваяСтрока.ИДФайла        = Новый УникальныйИдентификатор(); 
					НоваяСтрока.Расширение     = Расширение;
					НоваяСтрока.АдресФайла     = АдресФайла;
					НоваяСтрока.ТипСодержимого = "image/png";
					УдалитьФайлы(ПутьКФайлу);
				КонецЕсли;
				
			КонецЕсли;
				
		Иначе
				
			Возврат Неопределено;
				
		КонецЕсли;	
	#КОНЕЦЕСЛИ
	
	#ЕСЛИ ТонкийКлиент ТОГДА
		
		Режим = РежимДиалогаВыбораФайла.Открытие;
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
		ДиалогОткрытияФайла.ПолноеИмяФайла = "";
		ДиалогОткрытияФайла.МножественныйВыбор = Истина;
		ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
		Если ДиалогОткрытияФайла.Выбрать() Тогда
		    МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
		    Для Каждого ИмяФайла Из МассивФайлов Цикл
				
				Рез = Новый ДвоичныеДанные(ИмяФайла);
				
				Расширение    = "";
				ДД        = Рез;	
				ИД         = Форма.УникальныйИдентификатор; //Киселев  Новый УникальныйИдентификатор();
				
				АдресФайла = ПолучитьИмяВременногоФайла();
				ДД.Записать(АдресФайла);
				
				ДопПараметры = Новый Структура();
				ДопПараметры.Вставить("ПутьКФайлу", АдресФайла);
				ДопПараметры.Вставить("Расширение", Расширение);
				Возврат ДопПараметры;
				
				
		    КонецЦикла;
		Иначе
		    Предупреждение(НСтр("ru = 'Файл(ы) не выбран!'; en = 'File(s) not selected!'"));
		КонецЕсли;
		
		
	#КОНЕЦЕСЛИ	
		
		
	
КонецФункции	

Процедура ДобавитьФайлВТаблицуПрисоединенных(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если Результат = Истина Тогда
		
			НоваяСтрока                = ДопПараметры.Форма.Таблица_ПрисоединенныеФайлы.Добавить();
			НоваяСтрока.ИДФайла        = Новый УникальныйИдентификатор();
			НоваяСтрока.Расширение     = ДопПараметры.Расширение;
			НоваяСтрока.АдресФайла     = ДопПараметры.ПутьКФайлу;
			НоваяСтрока.ТипСодержимого = "image/png";
			
		КонецЕсли;
			
	Иначе	
		//ПереснимемФото
		УдалитьФайлы(ДопПараметры.ПутьКФайлу);
		ПрисоединенныеФайлы_ДобавитьФайл(ДопПараметры.Форма);
		
	КонецЕсли;
	
КонецПроцедуры

#КОНЕЦОБЛАСТИ