
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УзелОбмена = ПланыОбмена.ОС_ОбменСМобильнымиУстройствами.НайтиПоКоду("ЦБ");
	ОбновитьСервер();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьСервер();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСервер ()
	ТаблицаИзменений.Очистить();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Узел",УзелОбмена);
	Для Каждого Мета Из Метаданные.ПланыОбмена.ОС_ОбменСМобильнымиУстройствами.Состав Цикл
		Запрос.Текст = "Выбрать Количество (1) Как Количество Из " + Мета.Метаданные.ПолноеИмя() + ".Изменения Где Узел = &Узел";
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		НоваяСтрока                     = ТаблицаИзменений.Добавить();
		НоваяСтрока.Метаданные          = Мета.Метаданные.ПолноеИмя();
		НоваяСтрока.Синоним             = Мета.Метаданные.Представление();
		НоваяСтрока.КоличествоИзменений = Выборка.Количество;
	КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура ОчиститьИзменения(Команда)
	Текстрока = Элементы.ТаблицаИзменений.ТекущиеДанные;
	ОчиститьСервер(ТекСтрока.Метаданные);
КонецПроцедуры

&НаСервере
Процедура ОчиститьСервер (ПолноеИмя)
	ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена,Неопределено);
	ОбновитьСервер();
КонецПроцедуры	
