
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Контрагент") И Не ЗначениеЗаполнено(ЭтотОбъект.Запись.Контрагент) Тогда
		ЭтотОбъект.Запись.Контрагент = Параметры.Контрагент;
	КонецЕсли;
	Если Параметры.Свойство("ТорговыйПредставитель") И Не ЗначениеЗаполнено(ЭтотОбъект.Запись.ТорговыйПредставитель) Тогда
		ЭтотОбъект.Запись.ТорговыйПредставитель = Параметры.ТорговыйПредставитель;
	КонецЕсли;
	Если Параметры.Свойство("РежимОткрытия") И Параметры.РежимОткрытия = "ДляВводаЗначения" Тогда
		Элементы.Контрагент.ТолькоПросмотр = Истина;
		Элементы.ТорговыйПредставитель.ТолькоПросмотр = Истина;
	КонецЕсли;
	Если Параметры.Свойство("Посещение") Тогда
		Посещение = Параметры.Посещение;
	Иначе
		Посещение = Документы.Посещение.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Всп = "";
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено( Посещение ) Тогда
		текПосещение = Посещение.ПолучитьОбъект();
		текПосещение.РезультатПосещения = Запись.Комментарий;
		текПосещение.Записать();
	КонецЕсли;
КонецПроцедуры
