
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаДоставкиСтрокой = Формат(Параметры.ТекДатаДоставки,"ДФ=yyyy.MM.dd");
	мСписок = Элементы.ДатаДоставкиСтрокой.СписокВыбора;
	ТекДата = КонецДня(ТекущаяДата()) + 1;
	Для СЧ = 1 По 7 Цикл         		
		ДобавитьДатуВСписок(ТекДата,мСписок);
		ТекДата = КонецДня(ТекДата) + 1;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ДобавитьДатуВСписок (Дата,Список)
	Список.Добавить(Формат(Дата,"ДФ=yyyy.MM.dd"),ОбщийМодульСервер.ФорматДаты(Дата,Истина));
КонецПроцедуры	

&НаКлиенте
Процедура ДатаДоставкиСтрокойПриИзменении(Элемент)
	Если Не ПустаяСтрока(ДатаДоставкиСтрокой) Тогда
		мДата = ОбщийМодульСервер.РазложитьСтрокуВМассивПодстрок(ДатаДоставкиСтрокой,".");
		Закрыть(Дата(мДата[0],мДата[1],мДата[2]));
	КонецЕсли;
КонецПроцедуры
