
&НаСервере
Процедура КомандаОбновитьНаСервере()
	ТаблицаЗаданий.Очистить();
	СписокЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания();
	Для Каждого Задание Из СписокЗаданий Цикл
		НоваяСтрока = ТаблицаЗаданий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Задание);
	КонецЦикла;	
	ТаблицаЗаданий.Сортировать("Начало Возр");
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	КомандаОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КомандаОбновитьНаСервере();
КонецПроцедуры
