
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Заголовок = Параметры.ВыводимаяИнформация;
	
	ЗаполнитьТаблицуНаСервере(Параметры.ВыводимаяИнформация);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНаСервере(ВидЗаполнения)
	
	Если ВидЗаполнения = "Заказы с планшета" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Дата КАК ДатаДокумента,
		|	ЗаказПокупателя.ДатаДоставки КАК ДатаОтгрузки,
		|	ЗаказПокупателя.Контрагент КАК Грузополучатель,
		|	ЗаказПокупателя.Номер КАК НомерДокумента,
		|	ЗаказПокупателя.КоличествоSKU,
		|	ЗаказПокупателя.СуммаДокумента КАК СуммаЗаказа
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.ДатаДоставки > &ТекущаяДата
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОтгрузки,
		|	Грузополучатель";
		
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		
		ИсторияЗаказов.Загрузить(Запрос.Выполнить().Выгрузить());	
		
	ИначеЕсли ВидЗаполнения = "Возвраты с планшета" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратТоваровОтПокупателя.Дата КАК ДатаДокумента,
		|	ВозвратТоваровОтПокупателя.ДатаДоставки КАК ДатаОтгрузки,
		|	ВозвратТоваровОтПокупателя.Контрагент КАК Грузополучатель,
		|	ВозвратТоваровОтПокупателя.Номер КАК НомерДокумента,
		|	ВозвратТоваровОтПокупателя.КоличествоSKU,
		|	ВозвратТоваровОтПокупателя.СуммаДокумента КАК СуммаЗаказа
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
		|ГДЕ
		|	ВозвратТоваровОтПокупателя.ДатаДоставки > &ТекущаяДата
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОтгрузки,
		|	Грузополучатель";
		
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		
		ИсторияЗаказов.Загрузить(Запрос.Выполнить().Выгрузить());
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Балмико_ДанныеПоЗаказамДляМП.ДатаДокумента,
		|	Балмико_ДанныеПоЗаказамДляМП.ДатаОтгрузки КАК ДатаОтгрузки,
		|	Балмико_ДанныеПоЗаказамДляМП.Грузополучатель КАК Грузополучатель,
		|	Балмико_ДанныеПоЗаказамДляМП.НомерДокумента,
		|	Балмико_ДанныеПоЗаказамДляМП.Операция,
		|	Балмико_ДанныеПоЗаказамДляМП.СпособПолучения,
		|	Балмико_ДанныеПоЗаказамДляМП.Ответственный,
		|	Балмико_ДанныеПоЗаказамДляМП.КоличествоSKU,
		|	Балмико_ДанныеПоЗаказамДляМП.СуммаЗаказа
		|ИЗ
		|	РегистрСведений.Балмико_ДанныеПоЗаказамДляМП КАК Балмико_ДанныеПоЗаказамДляМП
		|ГДЕ
		|	Балмико_ДанныеПоЗаказамДляМП.Операция = &Операция
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОтгрузки,
		|	Грузополучатель";
		
		Запрос.УстановитьПараметр("Операция", ?(ВидЗаполнения = "Возвраты по территории", "Возврат", "Заказ"));
		
		ИсторияЗаказов.Загрузить(Запрос.Выполнить().Выгрузить());				
	КонецЕсли;		
	
КонецПроцедуры
