Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ШаблонАнкеты = Справочники.ШаблонАнкетыДляТП.ПолучитьПредопределенныйЭлемент("АктуализацияКонтактныхДанных") Тогда
		РегистрыСведений.ВыполнениеЗаданийТП.ОтметитьВыполнениеЗаданияТП( Посещение.Маршрут, Контрагент, "АктуализацияКонтактныхДанных", Ссылка );
	Иначе
		РегистрыСведений.ВыполнениеЗаданийТП.ОтметитьВыполнениеЗаданияТП( Посещение.Маршрут, Контрагент, "Анкета", Ссылка, ШаблонАнкеты);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	РегистрыСведений.ВыполнениеЗаданийТП.УдалитьВыполнениеЗаданияТП( Ссылка );
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Сотрудник = Константы.ТекущийПользователь.Получить();
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		ТорговыйПредставитель = Сотрудник.ФизЛицо;
	КонецЕсли;
	
КонецПроцедуры
