
&НаСервере
Процедура ОчиститьНаСервере()
	Набор = РегистрыСведений.ГеоКоординаты.СоздатьНаборЗаписей();
	Набор.ОбменДанными.Загрузка = Истина;
	Набор.ОбменДанными.Отправитель = ПланыОбмена.ОС_ОбменСМобильнымиУстройствами.НайтиПоКоду("ЦБ");
	Набор.Записать(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	ОткрытьФорму("РегистрСведений.ГеоКоординаты.ФормаЗаписи");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВсеКоординаты(Команда)
	
	Если Не ОбщийМодульСервер.ПользовательЗарегистрирован() Тогда
		Сообщить("Пользователь не зарегистрирован");
	КонецЕсли;	
	
	СЧ = 0;
	
	Результат = ОбщийМодульСервер.ПрочитатьКоординатыАгентаСервер();
	
	Пока Истина = Результат.Успех Цикл
		СЧ = СЧ + 1;
		Если СЧ = 100 Тогда
			Прервать;
		КонецЕсли;	
		Результат = ОбщийМодульСервер.ПрочитатьКоординатыАгентаСервер();
	КонецЦикла;

КонецПроцедуры
