
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Набор = Движения.СостоянияРабочегоДня;
	Набор.Очистить();
	Набор.Записывать = Истина;
	
	Запись             = Движения.СостоянияРабочегоДня.Добавить();
	Запись.РабочийДень = Ссылка;
	Запись.Начат       = Истина;
	Запись.Завершен    = Завершен;
	Запись.Период      = Дата;
	Запись.Сотрудник   = Сотрудник;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Сотрудник = Константы.ТекущийПользователь.Получить();
	КонецЕсли;	
	ТорговыйПредставитель = Сотрудник.ФизЛицо;
КонецПроцедуры
