
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		Закрыть(Элемент.ТекущиеДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.ГруппыНоменклатуры КАК ГруппыНоменклатуры";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Настройки = Выборка.Ссылка.НастройкиУсловногоОформления.Получить();
		Если Настройки <> Неопределено Тогда
			ЭлОформления = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
			
			Поле = ЭлОформления.Поля.Элементы.Добавить();
			Поле.Поле          = Новый ПолеКомпоновкиДанных("Список");
			Поле.Использование = Истина;
			
			Отбор = ЭлОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отбор.Использование  = Истина;
			Отбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.Ссылка");
			Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			Отбор.ПравоеЗначение = Выборка.Ссылка;
			
			Для Каждого Эл Из Настройки Цикл
				ЭлНастройка = ЭлОформления.Оформление.Элементы.Найти(Эл.Ключ);
				Если ЭлНастройка <> Неопределено Тогда
					ЭлНастройка.Значение = Эл.Значение;
					ЭлНастройка.Использование = Истина;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры
