&Насервере
Процедура ОбновлениеИнформационнойБазы() Экспорт
	
	ТекущаяВерсия = Константы.ВерсияКонфигурации.Получить();
	
	Если СинхронизацияСервер.ТребуетсяОбновление(ТекущаяВерсия, Метаданные.Версия) Тогда
		
		Результат = ОбновлениеНаВерсию_2_1_01();
		
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Если Результат.Ошибка = Истина Тогда
			
			Сообщить("Ошибка обновления возможна некорректная работа системы.
						|Обратитесь к администратору", СтатусСообщения.Важное);
			
		Иначе
			
			Константы.ВерсияКонфигурации.Установить(Метаданные.Версия);
			
			Сообщить("Обновление успешно завершено.", СтатусСообщения.Информация);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&Насервере
Функция ОбновлениеНаВерсию_2_1_01()
	
	Сообщить("Производится обновление на версию 2.0.100.");
	Ошибка = Новый Структура();	
	
	Попытка
	
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ЗаданияТППоВнеплановымПосещениям.Регистратор
		               |ИЗ
		               |	РегистрСведений.ЗаданияТППоВнеплановымПосещениям КАК ЗаданияТППоВнеплановымПосещениям
		               |ГДЕ
		               |	ЗаданияТППоВнеплановымПосещениям.Удалить_ШаблонАнкеты <> ЗНАЧЕНИЕ(Справочник.ШаблонАнкетыДляТП.ПустаяСсылка)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Набор = РегистрыСведений.ЗаданияТППоВнеплановымПосещениям.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(Выборка.Регистратор);
			Набор.Прочитать();
			
			Для каждого Стр из Набор Цикл
				
				Если ЗначениеЗаполнено(Стр.Удалить_ШаблонАнкеты) Тогда
					
					Стр.ШаблонАнкеты = Стр.Удалить_ШаблонАнкеты;
					Стр.Удалить_ШаблонАнкеты  = Справочники.ШаблонАнкетыДляТП.ПустаяСсылка();
					
				КонецЕсли;
				
			КонецЦикла;
			
			Набор.Записать();
			
		КонецЦикла;
		
		
		
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ЗаданияТП.Регистратор
		               |ИЗ
		               |	РегистрСведений.ЗаданияТП КАК ЗаданияТП
		               |ГДЕ
		               |	ЗаданияТП.Удалить_ШаблонАнкеты <> ЗНАЧЕНИЕ(Справочник.ШаблонАнкетыДляТП.ПустаяСсылка)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Набор = РегистрыСведений.ЗаданияТП.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(Выборка.Регистратор);
			Набор.Прочитать();
			
			Для каждого Стр из Набор Цикл
				
				Если ЗначениеЗаполнено(Стр.Удалить_ШаблонАнкеты) Тогда
					
					Стр.ШаблонАнкеты = Стр.Удалить_ШаблонАнкеты;
					Стр.Удалить_ШаблонАнкеты  = Справочники.ШаблонАнкетыДляТП.ПустаяСсылка();
					
				КонецЕсли;
				
			КонецЦикла;
			
			Набор.Записать();
			
		КонецЦикла;
		
		
		Ошибка.Вставить("Ошибка", Ложь)
		
	Исключение
		
		Ошибка.Вставить("Ошибка", Истина);
		Ошибка.Вставить("ТекстОшибки", ОписаниеОшибки());
		
	КонецПопытки;	
	
	Возврат Ошибка;	
	
КонецФункции

//Удалить. Делалось для теста
Процедура СоздатьАнкетуТест()
	
	Пользователь = Справочники.Пользователи.СоздатьЭлемент();
	Пользователь.Наименование = "Пользователь";
	Пользователь.Записать();
	
	Константы.ТекущийПользователь.Установить(Пользователь.Ссылка);
	
	Шаблон = Справочники.ШаблонАнкетыДляТП.СоздатьЭлемент();
	Шаблон.Наименование = "Тест";
	Шаблон.ВопросыВыводитьПоОчереди = Истина;
	Шаблон.Идентификатор = "Тест";
	
	Шаблон.Записать();
	
	Вопрос = Справочники.ВопросыАнкетДляТП.СоздатьЭлемент();
	Вопрос.Наименование = "Состояние";
	Вопрос.ТипВопроса = Перечисления.ТипыВопросовАнкетДляТП.ВыборЗначенияИзСписка;
	Вопрос.Владелец = Шаблон.Ссылка;
	
	ТЧ = Вопрос.ВариантыОтветов;
	
	Нов = ТЧ.Добавить();
	Нов.ВариантОтвета = "Новый Клиент";
	
	Нов = ТЧ.Добавить();
	Нов.ВариантОтвета = "Клиент по адресу";
	
	Нов = ТЧ.Добавить();
	Нов.ВариантОтвета = "Точка не существует";
	Нов.ЗакончитьАнкетирование = Истина;
	
	Вопрос.Записать();
	
	
	
	Вопрос = Справочники.ВопросыАнкетДляТП.СоздатьЭлемент();
	Вопрос.Наименование = "Сотрудничество";
	Вопрос.ТипВопроса = Перечисления.ТипыВопросовАнкетДляТП.ВыборЗначенияИзСписка;
	Вопрос.Владелец = Шаблон.Ссылка;
	
	ТЧ = Вопрос.ВариантыОтветов;
	
	Нов = ТЧ.Добавить();
	Нов.ВариантОтвета = "Хочет";
	
	Нов = ТЧ.Добавить();
	Нов.ВариантОтвета = "Нехочет";
	Нов.ЗакончитьАнкетирование = Истина;
	
	Вопрос.Записать();
	
	
	Вопрос2 = Справочники.ВопросыАнкетДляТП.СоздатьЭлемент();
	Вопрос2.Наименование = "Телефон";
	Вопрос2.ТипВопроса = Перечисления.ТипыВопросовАнкетДляТП.ВводЗначения;
	Вопрос2.Владелец = Шаблон.Ссылка;
	Вопрос2.Родитель = Вопрос.Ссылка;
	Вопрос2.ОтветРодителя = "Хочет";
	
	Вопрос2.Записать();
	
	Вопрос2 = Справочники.ВопросыАнкетДляТП.СоздатьЭлемент();
	Вопрос2.Наименование = "Причина отказа";
	Вопрос2.ТипВопроса = Перечисления.ТипыВопросовАнкетДляТП.ВводЗначения;
	Вопрос2.Владелец = Шаблон.Ссылка;
	Вопрос2.Родитель = Вопрос.Ссылка;
	Вопрос2.ОтветРодителя = "Нехочет";
	
	Вопрос2.Записать();
	
КонецПроцедуры