
Процедура ПриНачалеРаботыСистемы()
	Если ОбщийМодульСервер.ПолучитьЗначениеКонстанты("ДатаПоследнейОчисткиЛогов") < НачалоДня(ТекущаяДата()) - (24 * 60 * 60) Тогда
		РаботаСЖурналом.ОчиститьФайлЛогов();
	КонецЕсли;
	
	//Если Не ОбщийМодульСервер.ПолучитьЗначениеКонстанты("ОграниченияОчищены") Тогда
	//	ТестСервер.ОчиститьОграничения();
	//КонецЕсли;
КонецПроцедуры

Процедура ПередНачаломРаботыСистемы(Отказ)
	
	//ТестСервер.ПроверитьПлан();
	
	// 2017-06-05 МСН
	ОбщийМодульСервер.ПроверитьСкорректироватьУзелПланаОбмена();
	
	// 2017-06-29 МСН
	ОбщийМодульСервер.УстановитьЗначениеКонстанты("ПолныйДоступ", Ложь);
	
КонецПроцедуры
