Функция ФотоФасада() Экспорт
	Всп = Справочники.ВидыКомментариев.ПолучитьСсылку( Новый УникальныйИдентификатор("efd0ecf1-ce44-11e5-a23b-002590fc71a5") );
	Если Не Всп.Ссылка.Пустая() И Всп.Ссылка <> Неопределено Тогда
		Возврат Всп.Ссылка;
	Иначе
		Возврат Справочники.ВидыКомментариев.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция ФотоПолкиДоМерчендайзинга() Экспорт
	Всп = Справочники.ВидыКомментариев.ПолучитьСсылку( Новый УникальныйИдентификатор("b3334822-2fdd-11e5-bec1-bb21c2f2f53a") );
	Если Не Всп.Ссылка.Пустая() И Всп.Ссылка <> Неопределено Тогда
		Возврат Всп.Ссылка;
	Иначе
		Возврат Справочники.ВидыКомментариев.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция ПолучитьПредопределенныйЭлемент( Идентификатор ) Экспорт
	Если Не ЗначениеЗаполнено( Идентификатор ) Тогда
		Возврат Справочники.ВидыКомментариев.ПустаяСсылка();
	Иначе
		Возврат Справочники.ВидыКомментариев.НайтиПоРеквизиту("Идентификатор", Идентификатор );
	КонецЕсли;
КонецФункции
