
Процедура ПередЗаписью(Отказ)
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыКомментариев.Ссылка
		|ИЗ
		|	Справочник.ВидыКомментариев КАК ВидыКомментариев
		|ГДЕ
		|	ВидыКомментариев.Идентификатор = &Идентификатор";
		Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Отказ = ВыборкаДетальныеЗаписи.Следующий();
	КонецЕсли;
	
КонецПроцедуры
