
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#ЕСЛИ МобильноеПриложениеКлиент Тогда
		мВерсия = ОбщийМодульКлиент.ВерсияСлужб();
		Элементы.ДекорацияВерсияСлужб.Заголовок = ?(мВерсия = 0,"Службы не установлены!", "Версия служб: " + мВерсия);
	#КонецЕсли
	
	#ЕСЛИ ТОНКИЙКЛИЕНТ ТОГДА
		Для Каждого Эл Из Элементы.ГруппаНастройки.ПодчиненныеЭлементы Цикл 
			Эл.ТолькоПросмотр = Ложь;
		КонецЦикла;	
	#КОНЕЦЕСЛИ	
КонецПроцедуры

&НаСервере
Процедура КомандаПроверитьНаСервере()
	СтрЗапроса = Новый Структура; 	
	СтрЗапроса.Вставить("ИнформацияОКонфигурации", ПолучитьИнфуОКонфигурации());
	СтрЗапроса.Вставить("ТипРегистрации"         ,"ОбновитьПараметрыПодключения");
    СтруктураПодключения = Константы.НастройкиПодключения.Получить().Получить();
	СтандартнаяСтруктура = СтандартныеНастройкиПодключения();
	СтруктураПодключения.Вставить("Адрес","http://"+СтрЗаменить(НаборКонстант.АдресСервера,"\","/")+"/ws/DataTransfer.1cws?wsdl");
	СтруктураПодключения.ИмяФункции = "Registration";
	СтруктураПодключения.Пользователь = СтандартнаяСтруктура.Пользователь;
	СтруктураПодключения.Пароль = СтандартнаяСтруктура.Пароль;
	
	Ответ                = ПодключениеКВебСервисуЦентральнойБД(СтрЗапроса,СтруктураПодключения);
	Если ОбработкаОшибок(Ответ.Ошибка) Тогда
		Возврат; 
	Иначе
		Константы.НастройкиПодключения.Установить(Новый ХранилищеЗначения(Ответ.СтруктураСоединенияСЦентральнойБазой));
		Сообщить(Ответ.Информация);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверить(Команда)
	КомандаПроверитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьПолныйДоступ(Команда)
	ПоказатьВводСтроки( Новый ОписаниеОповещения("ПослеВводаПароля", ЭтаФорма), , "Введите пароль", 50, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаПароля(Результат, ДопПараметры) Экспорт
	Если Результат <> Неопределено И СокрЛП(Результат) = "@venue223" Тогда
		ОбщийМодульСервер.УстановитьЗначениеКонстанты("ПолныйДоступ", Истина);
		
		Сообщить("Доступ предоставлен");
	КонецЕсли;
КонецПроцедуры
