&НаКлиенте
Процедура ОбновитьСписокБаз()
	
	СписокБаз.Очистить();

	МасП = НайтиФайлы(
		"/data/data/com.e1c.mobile/files/", 
		"*.1CD", 
		Истина	
	);
	
	Для каждого СтрМ Из МасП Цикл
		
		Если СтрМ.Имя = "1Cv8.1CD" Тогда 			
			
			СписокБаз.Добавить(СтрМ.ПолноеИмя);				
			
		КонецЕсли;                              		
	
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПутьКПапке = "/sdcard/1cbackup"
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	ОбновитьСписокБаз();    	
КонецПроцедуры

&НаКлиенте
Процедура СписокБазОбработкаЗапросаОбновления()
	ОбновитьСписокБаз();	
КонецПроцедуры

&НаКлиенте
Процедура ЗабратьБазу(Команда)
	
	Попытка
	
		КопироватьФайл(
			Элементы.СписокБаз.ТекущиеДанные.Значение,
			ПутьКПапке + "/1Cv8.1CD"
		);
			
	Исключение
		Сообщить("Ошибка копирования базы (" + ОписаниеОшибки()+")");		
	КонецПопытки;
			
КонецПроцедуры

&НаКлиенте
Процедура ВостановитьБазу(Команда)
	
	Если Вопрос("Востановить базу ?",РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
		Возврат;	
	КонецЕсли; 
	
	Попытка
	
		КопироватьФайл(
			ПутьКПапке + "/1Cv8.1CD",
			Элементы.СписокБаз.ТекущиеДанные.Значение
		);
			
	Исключение
		Сообщить("Ошибка Востановления базы (" + ОписаниеОшибки()+")");		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	
	МасП = НайтиФайлы("/data/data/com.e1c.mobile/files/", "*.1CD", Истина);
	
	Для каждого СтрМ Из МасП Цикл
		
		Если СтрМ.Имя = "1Cv8.1CD" Тогда 			
			
			Сообщить(СтрМ.ПолноеИмя+"!!ewwewewjhjhjh!");				
			
		КонецЕсли;                              		
	
	КонецЦикла;	
	
КонецПроцедуры




