
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Контрагент = Параметры.Контрагент;
	ЦельПосещения = Параметры.ЦельПосещения;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНачатьПосещение(Команда)
	
	Если ПустаяСтрока(ЦельПосещения) Тогда
		ПоказатьПредупреждение(, "Не указана цель посещения");
	Иначе
		Парам = Новый Структура("НачатьПосещение,ЦельПосещения", Истина, ЦельПосещения);
		Закрыть(Парам);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменить(Команда)
	
	Парам = Новый Структура("НачатьПосещение,ЦельПосещения", Ложь, ЦельПосещения);
	Закрыть(Парам);
	
КонецПроцедуры
