
&НаКлиенте
Процедура КомандаПодтвердить(Команда)
	Данные = Новый Структура("ВидДокумента,ДополнениеКАдресуДоставки,ФБ_ОтдельнаяНакладная,Предзаказ");
	ЗаполнитьЗначенияСвойств(Данные,ЭтаФорма);
	Данные.Вставить("ТаблицаДопРеквизитов",ПолучитьАдресТаблицыДопРеквизитов());
	Закрыть(ПоместитьВоВременноеХранилище(Данные,Новый УникальныйИдентификатор));
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресТаблицыДопРеквизитов ()
	Возврат ДополнительныеРеквизитыСервер.ПолучитьТаблицуДополнительныхРеквизитов(ЭтаФорма,Тип("ДокументСсылка.ЗаказПокупателя"),Элементы.ГруппаДополительныеПараметры);
КонецФункции	

&НаКлиенте
Процедура КомандаОтменить(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	Текст = Новый Массив;
	Текст.Добавить("Всего строк: ");
	мШрифт = новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,,Истина);
	Текст.Добавить(Новый ФорматированнаяСтрока("" + Параметры.КоличествоСтрок,мШрифт));
	Текст.Добавить(" на сумму: ");
	Текст.Добавить(Новый ФорматированнаяСтрока("" + Параметры.СуммаДокумента,мШрифт));
	Элементы.ДекорацияНадписьвсего.Заголовок = Новый ФорматированнаяСтрока(Текст);	
	
	Текст = Новый Массив;
	Текст.Добавить("Дата доставки: ");
	Текст.Добавить(Новый ФорматированнаяСтрока(Формат(Параметры.ДатаДоставки, "ДФ=dd.MM.yyyy"),мШрифт));
	Элементы.ДекорацияНадписьДата.Заголовок = Новый ФорматированнаяСтрока(Текст);
	
	Данные = ПолучитьИзВременногоХранилища(Параметры.РеквизитыДокумента);
	ЗаполнитьЗначенияСвойств(ЭтаФорма,Данные);
	
	Если Не ЗначениеЗаполнено(ВидДокумента) Тогда
		ВидДокумента = Перечисления.ВидыЗаказа.ОсновнойЗаказ;
	КонецЕсли;
		
	ДополнительныеРеквизитыСервер.ДобавитьДополнительныеРеквизиты(ЭтаФорма,Тип("ДокументСсылка.ЗаказПокупателя"),Элементы.ГруппаДополительныеПараметры, Данные.ТаблицаДопРеквизитов);
КонецПроцедуры

&НаКлиенте
Процедура ПредзаказПриИзменении(Элемент)
	Элементы.ОтдельнаяНакладная.Видимость = Не Предзаказ;
	Если Предзаказ Тогда
		ФБ_ОтдельнаяНакладная = Ложь;
	КонецЕсли;
КонецПроцедуры
