
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(ВидКомментария) И РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Сообщить("Не заполнен вид фотографии. Запись невозможна");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ТорговыйПредставитель = Сотрудник.ФизЛицо;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РегистрыСведений.ВыполнениеЗаданийТП.ОтметитьВыполнениеЗаданияТП( Посещение.Маршрут, Контрагент, ВидЗадания, Ссылка );
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	РегистрыСведений.ВыполнениеЗаданийТП.УдалитьВыполнениеЗаданияТП( Ссылка );
	
КонецПроцедуры
