
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Контрагент = Параметры.Контрагент;
	Дата = Параметры.Дата;
	Операция = Параметры.Операция;
	Заголовок = Операция + " на " + Формат(Дата,"ДЛФ=DD") + " контрагент: " + Контрагент;
	СформироватьОтчет();
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет ()
	Запрос       = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеПродаж.Номенклатура КАК Номенклатура,
	|	ДанныеПродаж.Дата КАК Дата,
	|	ДанныеПродаж.ПродажиСумма КАК Продажи,
	|	ДанныеПродаж.ВозвратыСумма КАК Возвраты,
	|	ДанныеПродаж.ВозвратыКоличество,
	|	ДанныеПродаж.ПродажиКоличество
	|ИЗ
	|	РегистрСведений.ОС_ДанныеПродажДляМП КАК ДанныеПродаж
	|ГДЕ
	|	ДанныеПродаж.Контрагент = &Контрагент
	|	И ДанныеПродаж.Дата = &Дата
	|	И ДанныеПродаж.ПродажиКоличество > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";
	Запрос.УстановитьПараметр("Контрагент" ,Контрагент);
	Запрос.УстановитьПараметр("Дата" ,Дата);
	
	Если Операция = "Возврат" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПродажиКоличество > 0", "ВозвратыКоличество < 0");
	КонецЕсли;
	
	Итог = 0;
	
	Результат.Очистить();
	
	СЧ = 5;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		Если Операция = "Возврат" Тогда			
			НоваяСтрока.Цена = Выборка.Возвраты / Выборка.ВозвратыКоличество;
			НоваяСтрока.Количество = Выборка.ВозвратыКоличество;
			НоваяСтрока.Сумма = Выборка.Возвраты;
		Иначе
			НоваяСтрока.Цена = Выборка.Продажи / Выборка.ПродажиКоличество;
			НоваяСтрока.Количество = Выборка.ПродажиКоличество;
			НоваяСтрока.Сумма = Выборка.Продажи;
		КонецЕсли;
		Итог = Итог + НоваяСтрока.Сумма;
	КонецЦикла;	
	
	Результат.Сортировать("Номенклатура");
	
	Если Результат.Количество() = 0 Тогда
		Элементы.ДекорацияНетДанных.Заголовок = "<< НЕТ ДАННЫХ >>";
	Иначе
		Элементы.ДекорацияНетДанных.Заголовок = "Итого: " + Итог + " р.";
	КонецЕсли;	
КонецПроцедуры	