

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастроитьФорму();
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму ()
	Эл = Элементы.КнопкаВыполнено;
	Если Объект.Прочитано Тогда
		Эл.Картинка  = БиблиотекаКартинок.ВыполнитьЗадачу;	
		Эл.Заголовок = "Прочитано";
	Иначе	
		Эл.Картинка  = БиблиотекаКартинок.Удалить;		
		Эл.Заголовок = "Не прочитано";
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура КомандаВыполнено(Команда)
	Объект.Прочитано = Не Объект.Прочитано;
	НастроитьФорму();
	Оповестить("УведомлениеПрочитано");
	ЗаписатьОбъект();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОбъект ()
	РеквизитФормыВЗначение("Объект").Записать();
КонецПроцедуры	

